SpaceTeam/rodos/src/bare-metal/efr32fg1p/sleeptimer/src/sl_sleeptimer.c
#endif // SL_SLEEPTIMER_WALLCLOCK_CONFIG

/*******************************************************************************
 * Active delay of 'time_ms' milliseconds.
 ******************************************************************************/
void sl_sleeptimer_delay_millisecond(uint16_t time_ms)
{
  volatile bool wait = true;
  sl_status_t error_code;
  sl_sleeptimer_timer_handle_t delay_timer;
  uint32_t delay = sl_sleeptimer_ms_to_tick(time_ms);

  error_code = sl_sleeptimer_start_timer(&delay_timer,
                                         delay,
                                         delay_callback,
                                         (void *)&wait,
                                         0,
                                         0);
  if (error_code == SL_STATUS_OK) {
    while (wait) { // Active delay loop.
    }
  }
}

/*******************************************************************************
 * Converts milliseconds in ticks.
 ******************************************************************************/
uint32_t sl_sleeptimer_ms_to_tick(uint16_t time_ms)
{
  return (uint32_t)((((uint32_t)time_ms * sleeptimer_hal_get_timer_frequency()) / 1000) + 1);
}

/*******************************************************************************
 * Converts 32-bits milliseconds in ticks.
 ******************************************************************************/
sl_status_t sl_sleeptimer_ms32_to_tick(uint32_t time_ms,
                                       uint32_t *tick)
{
  if (time_ms <= max_millisecond_conversion) {
    *tick = (uint32_t)((((uint64_t)time_ms * sleeptimer_hal_get_timer_frequency()) / 1000u) + 1);
    return SL_STATUS_OK;
  } else {
    return SL_STATUS_INVALID_PARAMETER;
  }
}

/***************************************************************************//**
 * Gets the maximum value that can be passed to the functions that have a
 * 32-bits time or timeout argument expressed in milliseconds.
 ******************************************************************************/
uint32_t sl_sleeptimer_get_max_ms32_conversion(void)
{
  return max_millisecond_conversion;
}

/*******************************************************************************
 * Converts ticks in milliseconds.
 ******************************************************************************/
uint32_t sl_sleeptimer_tick_to_ms(uint32_t tick)
{
  if (is_power_of_2(sleeptimer_hal_get_timer_frequency())) {
    return (uint32_t)(((uint64_t)tick * (uint64_t)1000u) >> div_to_log2(sleeptimer_hal_get_timer_frequency()));
  } else {
    return (uint32_t)(((uint64_t)tick * (uint64_t)1000u) / sleeptimer_hal_get_timer_frequency());
  }
}

/*******************************************************************************
 * Converts 64-bits ticks in milliseconds.
 ******************************************************************************/
sl_status_t sl_sleeptimer_tick64_to_ms(uint64_t tick,
                                       uint64_t *ms)
{
  if (tick <= UINT64_MAX / 1000) {
    if (is_power_of_2(sleeptimer_hal_get_timer_frequency())) {
      *ms =  (uint64_t)(((uint64_t)tick * (uint64_t)1000u) >> div_to_log2(sleeptimer_hal_get_timer_frequency()));
      return SL_STATUS_OK;
    } else {
      *ms = (uint64_t)(((uint64_t)tick * (uint64_t)1000u) / sleeptimer_hal_get_timer_frequency());
      return SL_STATUS_OK;
    }
  } else {
    return SL_STATUS_INVALID_PARAMETER;
  }
}
/*******************************************************************************
 * Process timer interrupt.
 *
 * @param local_flag Flag indicating the type of timer interrupt.
 ******************************************************************************/
void process_timer_irq(uint8_t local_flag)
{
  CORE_DECLARE_IRQ_STATE;
  if (local_flag & SLEEPTIMER_EVENT_OF) {
#if SL_SLEEPTIMER_WALLCLOCK_CONFIG
    uint32_t timer_freq = sl_sleeptimer_get_timer_frequency();

    overflow_tick_rest += calculated_tick_rest;
    if (overflow_tick_rest >= timer_freq) {
      second_count++;
      overflow_tick_rest -= timer_freq;
    }
    second_count = second_count + calculated_sec_count;
#endif
    overflow_counter++;

    update_first_timer_delta();
    set_comparator_for_next_timer();
  }

  if (local_flag & SLEEPTIMER_EVENT_COMP) {
    sl_sleeptimer_tick_count_t delta_tot = 0u;
    sl_sleeptimer_tick_count_t current_cnt = sleeptimer_hal_get_counter();

    delta_tot = current_cnt - last_delta_update_count;

    CORE_ENTER_ATOMIC();
    // Process all timers that have expired.
    while ((timer_head) && (delta_tot >= timer_head->delta)) {
      sl_sleeptimer_tick_count_t new_cnt;
      sl_sleeptimer_tick_count_t delta_tot_temp = delta_tot;
      sl_sleeptimer_timer_handle_t *current = timer_head;
      sl_sleeptimer_timer_handle_t *temp = timer_head;

      last_delta_update_count = current_cnt;

      while ((temp != NULL) && (delta_tot_temp >= temp->delta)) {
        if (current->priority > temp->priority) {
          current = temp;
        }

        delta_tot_temp -= temp->delta;
        temp = temp->next;
      }
      CORE_EXIT_ATOMIC();
      delta_tot -= current->delta;
      current->delta = 0;

      CORE_ENTER_ATOMIC();
      delta_list_remove_timer(current);
      CORE_EXIT_ATOMIC();

      if (current->timeout_periodic != 0u) {
        CORE_ENTER_ATOMIC();
        delta_list_insert_timer(current, current->timeout_periodic);
        CORE_EXIT_ATOMIC();
      }

      if (current->callback != NULL) {
        current->callback(current, current->callback_data);
      }

      new_cnt = sleeptimer_hal_get_counter();
      delta_tot += new_cnt - current_cnt;
      current_cnt = new_cnt;
      CORE_ENTER_ATOMIC();
    }

    if (timer_head) {
      timer_head->delta -= delta_tot;
      last_delta_update_count = current_cnt;

      set_comparator_for_next_timer();
    } else {
      sleeptimer_hal_disable_int(SLEEPTIMER_EVENT_COMP);
    }
    CORE_EXIT_ATOMIC();
  }
}

/*******************************************************************************
 * Timer expiration callback for the delay function.
 *
 * @param handle Pointer to handle to timer.
 * @param data Pointer to delay flag.
 ******************************************************************************/
static void delay_callback(sl_sleeptimer_timer_handle_t *handle,
                           void *data)
{
  volatile bool *wait_flag = (bool *)data;

  (void)handle;  // Unused parameter.

  *wait_flag = false;
}

